In [2]:
import pandas as pd

# Criando entruturas de dados

## 1. Criando Series

In [3]:
# criando uma series e redefinindo seu index

In [4]:
data = [1, 2, 3, 4, 5]

In [5]:
s = pd.Series(data)

In [6]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
index = ['Linha' + str(i) for i in range(5)]

In [8]:
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [9]:
s = pd.Series(data, index = index)

In [10]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [11]:
# se os dados da series forem dicionários, as chaves automaticamente viram índices

In [12]:
data = {'Linha' + str(i): i + 1 for i in range(5)}

In [13]:
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [14]:
s = pd.Series(data)

In [15]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [16]:
# operações com series de dicionários (concatenando)

In [17]:
s1 = s + 2

In [18]:
s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

In [19]:
s2 = s + s1

In [20]:
s2

Linha0     4
Linha1     6
Linha2     8
Linha3    10
Linha4    12
dtype: int64

## 2. Criando Dataframes

### 2.1 Algumas formas de criar

In [21]:
# criando o dataset
data = [[1, 2, 3], 
        [4, 5, 6], 
        [7, 8, 9]]

In [22]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [23]:
# transformando em dataframe
df1 = pd.DataFrame(data = data)

In [24]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [25]:
# alterando rótulos

In [26]:
index_customizado = ['Linha' + str(i) for i in range(3)]
index_customizado

['Linha0', 'Linha1', 'Linha2']

In [27]:
df1 = pd.DataFrame(data = data, index = index_customizado)

In [28]:
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [29]:
columns_customizado = ['Coluna' + str(i) for i in range(3)]
columns_customizado

['Coluna0', 'Coluna1', 'Coluna2']

In [30]:
df1 = pd.DataFrame(data = data, index = index_customizado, columns = columns_customizado)

In [31]:
df1

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [32]:
# criando dataset com dicionários
data = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
        'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
        'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [33]:
data

{'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
 'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [34]:
df2 = pd.DataFrame(data)
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [35]:
# criando o dataset com tuplas
data = [(1, 2, 3), 
        (4, 5, 6), 
        (7, 8, 9)]
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [36]:
df3 = pd.DataFrame(data = data, index = index_customizado, columns = columns_customizado)
df3

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

### 2.2 Concatenando dataframes

In [37]:
df1[df1 > 0] = 'A'
df1

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A

In [38]:
df2[df2 > 0] = 'B'
df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [39]:
df3[df3 > 0] = 'C'
df3

       Coluna0 Coluna1 Coluna2
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [40]:
df4 = pd.concat([df1, df2, df3])
df4

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [41]:
df4 = pd.concat([df1, df2, df3], axis = 1)
df4

       Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2
Linha0       A       A       A       B       B       B       C       C       C
Linha1       A       A       A       B       B       B       C       C       C
Linha2       A       A       A       B       B       B       C       C       C

### 2.3 Alterando índices e colunas

In [52]:
df1

        Coluña 0 Coluña 1 Coluña 2
Index 0        A        A        A
Index 1        A        A        A
Index 2        A        A        A

In [53]:
df1.index = ['Index 0', 'Index 1', 'Index 2']

In [54]:
df1

        Coluña 0 Coluña 1 Coluña 2
Index 0        A        A        A
Index 1        A        A        A
Index 2        A        A        A

In [50]:
df1.columns = [f'Coluña {i}' for i in range(3)]

In [51]:
df1

        Coluña 0 Coluña 1 Coluña 2
Index 0        A        A        A
Index 1        A        A        A
Index 2        A        A        A